Revit 2026 API

# ModelPathUtilsConvertCloudGUIDsToCloudPath Method

---

Converts a pair of cloud project and model GUIDs to a valid cloud path.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ModelPath ConvertCloudGUIDsToCloudPath(
	string region,
	Guid projectGuid,
	Guid modelGuid
)
```
```vb
Public Shared Function ConvertCloudGUIDsToCloudPath (
	region As String,
	projectGuid As Guid,
	modelGuid As Guid
) As ModelPath
```
```cpp
public:
static ModelPath^ ConvertCloudGUIDsToCloudPath(
	String^ region,
	Guid projectGuid,
	Guid modelGuid
)
```
```fsharp
static member ConvertCloudGUIDsToCloudPath :
        region : string *
        projectGuid : Guid *
        modelGuid : Guid -> ModelPath
```

#### Parameters

region String
     The region of the BIM 360 Docs or Autodesk Docs account and project which contains this model. Please see the reference values, like CloudRegionUS and CloudRegionEMEA, and the new regions from release note.
projectGuid Guid
     The GUID of the cloud project which contains the model.
modelGuid Guid
     The GUID of the Revit cloud model.

#### Return Value

ModelPath The cloud model path.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| CentralModelException | The cloud project is missing. |
| RevitServerCommunicationException | The central server could not be reached. |
| RevitServerUnauthenticatedUserException | You must sign in to Autodesk 360 in order to complete action. |
| RevitServerUnauthorizedException | You are unauthorized to access this resource. |

#### Reference

ModelPathUtils Class

Autodesk.Revit.DB Namespace